app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT * FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 2)

  def create
    @activity = Activity.new(params[:activity])
    @activity.user = current_user

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("project_id", "updated_at", "resource_id", "day", "created_at") VALUES(1, '2010-06-10 13:33:40', 1, '2010-06-09', '2010-06-10 13:33:40')

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 2)
UPDATE "activities" SET "project_id" = 1, "updated_at" = '2010-06-11 09:14:33' WHERE "id" = 2