app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT * FROM "activities" WHERE ("activities".project_id = 1)
---
  def show
    @project = Project.find(params[:id])
    @activity_by_user = []

    # get current user activities...
    @project.activities.each do |activity|

INSERT INTO "projects" ("updated_at", "title", "description", "created_at") VALUES('2010-06-10 08:15:54', 'Test', 'Toto', '2010-06-10 08:15:54')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def update
    @project = Project.find(params[:id])